<?php

$_lang['uf_prop_tplForm'] = 'Чанк с формой загрузки файлов.';
$_lang['uf_prop_tplAuth'] = 'Чанк, который выводится, если пользователю не разрешена загрузка файлов.';
$_lang['uf_prop_tplImage'] = 'Чанк с выводом параметров загруженного изображения.';
$_lang['uf_prop_tplFile'] = 'Чанк с выводом параметров загруженного файла.';
$_lang['uf_prop_tplOption'] = 'Чанк офорлмения одной опции генерации превью.';

$_lang['uf_prop_maxFilesize'] = 'Максимальный размер загружаемого файла, в байтах.';
$_lang['uf_prop_uploadiFive'] = 'Активация HTML5 версии загрузчика, без flash';
$_lang['uf_prop_fileExtensions'] = 'Список расширений, разрешенных для загрузки, через запятую.';
$_lang['uf_prop_imageExtensions'] = 'Список расширений, которые являются картинками и требуют особую обработку.';
$_lang['uf_prop_imageMaxWidth'] = 'Максимально допустимая ширина картинки. Изображения с большей шириной будут ужаты до этого значения.';
$_lang['uf_prop_imageMaxHeight'] = 'Максимально допустимая высота изображения. Изображения с большой высотой будут ужаты до этого значения.';
$_lang['uf_prop_imageQuality'] = 'Качество пережатия большого изображения.';
$_lang['uf_prop_thumbWidth'] = 'Ширина превью.';
$_lang['uf_prop_thumbHeight'] = 'Высота превью.';
$_lang['uf_prop_thumbZC'] = 'Нужно ли приблизить и обрезать превью, чтобы поместиться в заданные параметры.';
$_lang['uf_prop_thumbBG'] = 'Цвет заливки превью, если отключены обрезка и увеличение.';
$_lang['uf_prop_thumbQuality'] = 'Качество превью.';
$_lang['uf_prop_thumbFormat'] = 'Формат превью: jpg или png.';
$_lang['uf_prop_source'] = 'Номер источника файлов, перекрывает системную настройку.';
$_lang['uf_prop_listThumbSize'] = 'Список возможных размеров превью, через запятую';
$_lang['uf_prop_listThumbZC'] = 'Список вариантов обрезки и приближения, через запятую.';
$_lang['uf_prop_listThumbBG'] = 'Список возможных цетов заливки превью, через запятую.';
$_lang['uf_prop_authSnippet'] = 'Сниппет, проверяющий, можно ли пользователю загружать файлы. Должен возвращать 1 или 0.';
