<?php

$_lang['area_uf_frontend'] = 'Сайт';

$_lang['setting_uf_frontend_css'] = 'Стили фронтенда';
$_lang['setting_uf_frontend_css_desc'] = 'Путь к файлу со стилями магазина. Если вы хотите использовать собственные стили - укажите путь к ним здесь, или очистите параметр и загрузите их вручную через шаблон сайта.';
$_lang['setting_uf_frontend_js'] = 'Скрипты фронтенда';
$_lang['setting_uf_frontend_js_desc'] = 'Путь к файлу со скриптами магазина. Если вы хотите использовать собственные скрипты - укажите путь к ним здесь, или очистите параметр и загрузите их вручную через шаблон сайта.';
$_lang['setting_uf_source_default'] = 'Источник файлов по умолчанию';
$_lang['setting_uf_source_default_desc'] = 'Источник файлов для компонента Uploadify. Может быть переопределено настройками сниппета.';